package com.walking.lesson1_varaibles;

/**
 * Усложнение для внимательных: вывести ваше имя посимвольно,
 * где каждая буква — на новой строке, не используя System.out.println().
 * Реализуется с использованием String.
 */
public class Task2ComplicatedWithString {
    public static void main(String[] args) {
        /*
         * Объявляем переменную типа String и инициализируем ее своим именем.
         * После каждой буквы имени указываем управляющий символ \n,
         * который переводит курсор на новую строку
         * */
        String s = "Е\nг\nо\nр";
//        Выводим в консоль значение переменной s
        System.out.print(s);
    }

    /*
     * Примечание: если вы установили Java 15 или выше, вам доступен функционал текстовых блоков.
     * Они упрощают решение и позволяют его свести к
     *
     * String s = """
     *          Е
     *          г
     *          о
     *          р""";
     *
     *  System.out.print(s);
     *
     * Данное решение тоже допустимо
     * */
}
