package com.walking.lesson170_reflection.task1;

/**
 * Реализуйте метод, которая выводит в консоль метаинформацию о переданном классе:
 *
 * <ul>
 * <li> Полное имя класса;</li>
 * <li> Список полей с указанием их типов и модификаторов;</li>
 * <li> Список конструкторов с указанием их модификаторов доступа и параметров;</li>
 * <li> Список всех методов с указанием модификаторов, возвращаемого типа, имени и параметров.</li>
 * </ul>
 *
 * Опциональное усложнение: выводить не только методы указанного класса, но и доступные методы его предков.
 */
public class Main {
    public static void main(String[] args) {
    }

    public static void printClassInfo(Class<?> clazz) {
    }
}
