package com.walking.lesson57_stream_collect_collector;

import java.util.stream.Stream;

/**
 * Необходимо реализовать набор функций для HRM-системы компании,
 * каждая из которых сводится к формированию определенной статистики на базе информации
 * о всех департаментах компании и сотрудниках в них.
 * Реализация каждой задачи должна представлять собой отдельный метод (или класс),
 * единственным параметром которого является список всех департаментов в компании,
 * а возвращаемым значением – произвольный объект (чаще всего – какая-то коллекция),
 * хранящий информацию, которую требуется получить по условию задачи.
 */
public class Main {
    public static void main(String[] args) {
    }
}