package com.walking.lesson47_method_reference.task3;

/**
 * Реализуйте Задачу 3 из урока 46,
 * описав все реализуемые фильтры через method reference’ы.
 * Рекомендую вынести функциональность формирования фильтров в отдельный сервис,
 * если это не было сделано ранее.
 */
public class Main {
    public static void main(String[] args) {
        //Сделано.
        //см. задачу 48-3
        //переписал код работы с запросом
        //(теперь меню с выбором поиска и method reference под капотом)
    }
}
