package com.walking.lesson171_annotations.task3;

/**
 * Развейте решение, разработанное в
 * <a href="https://github.com/KFalcon2022/practical-tasks/blob/for-pr/src/com/walking/lesson170_reflection/task2/Main.java">Задаче 2</a>
 * предыдущей статьи.
 * <p>
 * Реализуйте аннотацию <code>@Component</code>, которая будет маркером загружаемых классов.
 * Также предоставьте возможность загружать все классы, аннотированные <code>@Component</code>,
 * для заданных пакетов. Список сканируемых пакетов должен предоставляться как параметр метода.
 * <p>
 * Результатом подобной доработки должен стать список всех классов, аннотированных <code>@Component</code>,
 * из указанных пакетов. Далее этот список должен передаваться в ранее созданный метод, создающий объект
 * для каждого класса, в соответствии с правилами, описанными в задаче предыдущей статьи.
 */
public class Main {
    public static void main(String[] args) {
    }
}
