-- Задача 1
-- Получите всех пассажиров, у которых имя начинается с буквы «I».

-- Задача 2
-- Получите всех пассажиров, у которых имя содержит букву «I» (в любом регистре).

-- Задача 3
-- Получите всех пассажиров, у которых первым из любимых аэропортов является Minsk, Moscow или Tallinn.

-- Задача 4
-- Найдите всех пассажиров, родившихся в XX веке.

-- Задача 5
-- Найдите всех пассажиров, родившихся не в XX веке.

-- Задача 6
-- Найдите всех пассажиров, которые застали Вторую мировую войну (1 сентября 1939 – 2 сентября 1945).