-- Задача 1
-- Найти всех пассажиров, чье имя и фамилия содержат хотя бы одну букву "a",
-- и у которых дата рождения меньше 1990 года.
-- Эту задачу можно решить и без подзапроса.
-- Поэтому предлагаю продумать хотя бы два возможных варианта решения.

-- Задача 2
-- Найти топ-3 аэропорта, которые являются самыми популярными среди пассажиров
-- (с наибольшим количеством упоминаний в столбце favorite_airports).
-- Для получения набора единичных элементов из массива существует агрегатная функция unnest().

-- Задача 3*
-- Найти количество мужчин и женщин среди пассажиров.
-- Пример вывода:

-- Male     |     Female
-- ----------------------
--    5     |       7