package com.walking.lesson73_barrier.task1;

/**
 * Эмулируйте сбор компании друзей в цикле.
 * <p>
 * Есть 10 друзей-потоков. Они должны собраться вместе (преодолеть) турникет.
 * Каждый из потоков имеет предел терпения, он же, время ожидание,
 * определенный в случайном порядке.
 * Также каждый из них имеет случайно определенную степень безответственности,
 * выражающуюся в задержке перед сбором.
 * <p>
 * Попробуйте собрать друзей, используя в качестве каждой попытки итерацию цикла.
 * Если хоть один из друзей не вытерпел и покинул место сбора – сбор должен провалиться.
 * <p>
 * С какой попытки друзьям удалось собраться?
 * <p>
 * Верхние и нижние границы терпения и безответственности определите самостоятельно.
 */
public class Main {
    public static void main(String[] args) {
    }
}