package com.walking.lesson30_regex.task1easy;

import java.util.regex.Pattern;

/**
 * Реализуйте boolean-метод, валидирующий входящую строку.
 * Метод должен возвращать true,
 * если строка соответствует номеру мобильного телефона
 * (в качестве примера привожу номер для РФ, вы можете выбрать любой другой, но со схожей маской).
 * <p>
 * Маска корректного номера: +7 (XXX) XXX-XX-XX,
 * где "X" – цифра от 0 до 9.
 * Обратите внимание на наличие скобок и пробелов.
 */
public class Main {
    public static void main(String[] args) {
        String[] inputs={
            "89246558354",
            "+7 (924) 653-29-98",
            "+7(924) 653-29-98",
            "+7 (924) 65329-98",
            "+7 (924) 653-29-98",
            "+7 924 653-29-98",
            "+7 (924)653-29-98",
            "+a (924) 653-29-98",
            " +7 (924) 663-29-98",
            "+7 (924) 653-29-94 ",
            "+7 (924) 603-29-98",
            "+7 (924) 653-29-68"
        };
        for (String s:inputs){
            System.out.println(s+" "+isValid(s));
        }
    }
    private static boolean isValid(String number){
        return Pattern.matches("^\\+7\\s\\(\\d{3}\\)\\s\\d{3}-\\d{2}-\\d{2}$", number);     
    }
}
